Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t
Represents the data structure for obtaining the extrema box of an object.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ObjectId
The ID of the object.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysOriginX
The X coordinate of the origin of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysOriginY
The Y coordinate of the origin of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysOriginZ
The Z coordinate of the origin of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysXAxisX
The X coordinate of the X-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysXAxisY
The Y coordinate of the X-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysXAxisZ
The Z coordinate of the X-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysYAxisX
The X coordinate of the Y-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysYAxisY
The Y coordinate of the Y-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.CoordsysYAxisZ
The Z coordinate of the Y-axis of the coordinate system.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMinX
The minimum X coordinate of the extrema box.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMinY
The minimum Y coordinate of the extrema box.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMinZ
The minimum Z coordinate of the extrema box.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMaxX
The maximum X coordinate of the extrema box.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMaxY
The maximum Y coordinate of the extrema box.

Tekla.Structures.ModelInternal.dotGetObjectExtremaBoxData_t.ExtremaMaxZ
The maximum Z coordinate of the extrema box.